app/controllers/admin/dashboard_controller.rb

  def show
    @products = Product.all
    @categories = Category.all
---
SELECT "categories".* FROM "categories"