app/controllers/admin/products_controller.rb

  def index
    @products = Product.order(id: :desc).all
---
SELECT "products".* FROM "products"  ORDER BY "products"."id" DESC