app/views/admin/dashboard/show.html.erb

SELECT COUNT(*) FROM "categories"
---
    <li class="list-group-item"><p>Total number of products in database is <%= @products.size %></p><%= link_to 'Go to Products list', admin_products_path,class: "btn btn-info" %></li>
    <li class="list-group-item"><p>Total number of categories in database is <%= @categories.size %></p><%= link_to 'Go to Categories page', [:admin, :categories], class: "btn btn-info" %></li>