app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  ORDER BY "products"."created_at" DESC  [["category_id", 3]]
---
  def show
    @category = Category.find(params[:id])
    #  raise  @category.inspect
    @products = @category.products.order(created_at: :desc)