app/controllers/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def create
    charge = perform_stripe_charge
    order  = create_order(charge)
    user = User.find_by_id(session[:user_id])